openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Fls.c
#define BLOCK_MASK 0x0003ffffUL

  // create the mask
  mask1 = ((-1UL)<<(31-endBlock))>>(31-endBlock);
  mask2 = ((-1UL)>>startBlock)<<startBlock;
  mask = mask1 & mask2;

#if defined( MPC5606S )
  eraseBlocks->lowEnabledBlocks = mask&0xffff;   // Bits 0..15 indicats low blocks
  eraseBlocks->midEnabledBlocks = (mask>>16)&3; // Bits 16..17 indicats mid blocks
  eraseBlocks->highEnabledBlocks = mask>>18;    // Bits 18..23 indicats high blocks
#else
  // shift things in to make freescale driver happy
  eraseBlocks->lowEnabledBlocks = mask&0x3ff;   // Bits 0..9 indicats low blocks
  eraseBlocks->midEnabledBlocks = (mask>>10)&3; // Bits 10..11 indicats mid blocks
  eraseBlocks->highEnabledBlocks = mask>>12;    // Bits 12..19 indicats high blocks
#endif

  return ;
}


void Fls_Init( const Fls_ConfigType *ConfigPtr )
{
  FLS_VALIDATE_STATUS_BUSY(Fls_Global.status, FLS_INIT_ID);
  Fls_Global.status 		= MEMIF_UNINIT;
  Fls_Global.jobResultType 	= MEMIF_JOB_PENDING;
  uint32 returnCode;
  Fls_EraseBlockType eraseBlocks;
  // TODO: FLS_E_PARAM_CONFIG
  Fls_Global.config = ConfigPtr;

#if (FLS_AC_LOAD_ON_JOB_START == STD_ON )
  /* Copy fls routines to RAM */
  memcpy(__FLS_ERASE_RAM__,__FLS_ERASE_ROM__, (size_t)&__FLS_SIZE__);

#endif


  returnCode = FlashInit( &ssdConfig );
#if defined( CFG_MPC5606S )
  returnCode = FlashInit( &ssdCode1Config );
  returnCode = FlashInit( &ssdDataConfig );
#endif

  // Lock shadow row..
  eraseBlocks.lowEnabledBlocks = 0;
  eraseBlocks.midEnabledBlocks = 0;
  eraseBlocks.highEnabledBlocks = 0;
  eraseBlocks.shadowBlocks = 1;

#if defined(CFG_MPC5606S)
  Fls_C90FL_SetLock(&ssdConfig,&eraseBlocks,1);
#else
  Fls_H7F_SetLock(&eraseBlocks,1);
#endif

  Fls_Global.status 		= MEMIF_IDLE;
  Fls_Global.jobResultType 	= MEMIF_JOB_OK;
  return;
}

/* TargetAddress always from 0 to FLS_TOTAL_SIZE */
Std_ReturnType Fls_Erase(	Fls_AddressType   TargetAddress,
                          Fls_LengthType    Length )
{
  uint32 endBlock;
  uint32 startBlock;
  uint32 rem;
  Fls_EraseBlockType eraseBlock;
  Fls_EraseInfoType eraseInfo;
  uint32 pc;

  FLS_VALIDATE_STATUS_UNINIT_W_RV(Fls_Global.status, FLS_ERASE_ID, E_NOT_OK);
  FLS_VALIDATE_STATUS_BUSY_W_RV(Fls_Global.status, FLS_ERASE_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_ADDRESS_SECTOR_W_RV(TargetAddress, FLS_ERASE_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_LENGTH_SECTOR_W_RV(TargetAddress, Length, FLS_ERASE_ID, E_NOT_OK);

  // Always check if status is not busy
  if (Fls_Global.status == MEMIF_BUSY )
     return E_NOT_OK;

  // TargetAddress
  startBlock = address_to_block(TargetAddress,&rem);

  if( (startBlock == (-1)) || (rem!=0) ) {
    DET_REPORTERROR(MODULE_ID_FLS,0,0x0,FLS_E_PARAM_ADDRESS );
    return E_NOT_OK;
  }

  endBlock = address_to_block(TargetAddress+Length,&rem);

  // Check if we trying to erase a partition that we are executing in
  pc = Fls_GetPc();
  if( (pc >= FLS_BASE_ADDRESS) && ( pc <= (FLS_BASE_ADDRESS + FLS_TOTAL_SIZE) ) ) {
    // In flash erase
  	uint32 pcBlock = address_to_block(pc,&rem);
  	uint8 *partMap = Fls_Global.config->FlsBlockToPartitionMap;

  	if( (partMap[pcBlock] >= partMap[startBlock]) && (partMap[pcBlock] <= partMap[endBlock]) ) {
        // Can't erase and in the same partition we are executing
        assert(0);
    }
  }

  Fls_Global.status = MEMIF_BUSY;
  Fls_Global.jobResultType = MEMIF_JOB_PENDING;
  Fls_Global.jobType = FLS_JOB_ERASE;

  address_to_erase_blocks(&eraseBlock,TargetAddress,Length);

  eraseBlock.shadowBlocks = 0;
  // Unlock

#if defined( CFG_MPC5606S )
  if ( TargetAddress < 0x80000 ) {
	  Fls_C90FL_SetLock(&ssdConfig, &eraseBlock,0);
  }
  else if ( TargetAddress < 0x100000 ){
	  Fls_C90FL_SetLock(&ssdCode1Config, &eraseBlock,0);
  }
  else {
	  Fls_C90FL_SetLock(&ssdDataConfig, &eraseBlock,0);
  }
#else
  Fls_H7F_SetLock(&eraseBlock,0);
#endif
  eraseInfo.state  = 0; // Always set this


#if defined( CFG_MPC5606S )
	Fls_Global.sourceAddr = TargetAddress;

  if ( TargetAddress < 0x80000 ) {
	  Fls_C90FL_FlashErase ( &ssdConfig ,
	              0, // shadowFlag...
	              eraseBlock.lowEnabledBlocks,
	              eraseBlock.midEnabledBlocks,
	              eraseBlock.highEnabledBlocks,
	              &eraseInfo
	                      );
   }
   else if ( TargetAddress < 0x100000 ){
	   Fls_C90FL_FlashErase ( &ssdCode1Config ,
	  	              0, // shadowFlag...
	  	              eraseBlock.lowEnabledBlocks,
	  	              eraseBlock.midEnabledBlocks,
	  	              eraseBlock.highEnabledBlocks,
	  	              &eraseInfo
	  	                      );
   }
   else {
	   Fls_C90FL_FlashErase ( &ssdDataConfig ,
	  	              0, // shadowFlag...
	  	              eraseBlock.lowEnabledBlocks,
	  	              eraseBlock.midEnabledBlocks,
	  	              eraseBlock.highEnabledBlocks,
	  	              &eraseInfo
	  	                      );
   }

#else
  Fls_H7F_FlashErase ( 	&ssdConfig ,
          0, // shadowFlag...
          eraseBlock.lowEnabledBlocks,
          eraseBlock.midEnabledBlocks,
          eraseBlock.highEnabledBlocks,
          &eraseInfo
                  );
#endif
  return E_OK;
}


Std_ReturnType Fls_Write (    Fls_AddressType   TargetAddress,
                        const uint8         *SourceAddressPtr,
                        Fls_LengthType    Length )
{
  Fls_EraseBlockType eraseBlock;

  FLS_VALIDATE_STATUS_UNINIT_W_RV(Fls_Global.status, FLS_WRITE_ID, E_NOT_OK);
  FLS_VALIDATE_STATUS_BUSY_W_RV(Fls_Global.status, FLS_WRITE_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_ADDRESS_PAGE_W_RV(TargetAddress, FLS_WRITE_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_LENGTH_PAGE_W_RV(TargetAddress, Length, FLS_WRITE_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_DATA_W_RV(SourceAddressPtr, FLS_WRITE_ID, E_NOT_OK)

  // Always check if status is not busy
  if (Fls_Global.status == MEMIF_BUSY )
     return E_NOT_OK;

