openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Fls.c
  // Destination is FLS_BASE_ADDRESS + TargetAddress
  Fls_Global.jobResultType = MEMIF_JOB_PENDING;
  Fls_Global.status = MEMIF_BUSY;
  Fls_Global.jobType = FLS_JOB_WRITE;

  // Fill in the required fields for programming...
  Fls_Global.flashWriteInfo.source = (uint32)SourceAddressPtr;
  Fls_Global.flashWriteInfo.dest = TargetAddress;
  Fls_Global.flashWriteInfo.size = Length;

  // unlock flash....
  address_to_erase_blocks(&eraseBlock,TargetAddress,Length);
  eraseBlock.shadowBlocks = 0;

#if defined( CFG_MPC5606S )
  if ( TargetAddress < 0x80000 ) {
	  Fls_C90FL_SetLock(&ssdConfig, &eraseBlock,0);
  }
  else if ( TargetAddress < 0x100000 ){
	  Fls_C90FL_SetLock(&ssdCode1Config, &eraseBlock,0);
  }
  else {
	  Fls_C90FL_SetLock(&ssdDataConfig, &eraseBlock,0);
  }
#else
  Fls_H7F_SetLock(&eraseBlock,0);
#endif
  return E_OK;
}

#if ( FLS_CANCEL_API == STD_ON )
void Fls_Cancel( void )
{
	/* API NOT SUPPORTED */
}
#endif


#if ( FLS_GET_STATUS_API == STD_ON )
MemIf_StatusType Fls_GetStatus(	void )
{
  return Fls_Global.status;
}
#endif


#if ( FLS_GET_JOB_RESULT_API == STD_ON )
MemIf_JobResultType Fls_GetJobResult( void )
{
  return Fls_Global.jobResultType;
}
#endif


void Fls_MainFunction( void )
{
  uint32 flashStatus;
  int result;

  FLS_VALIDATE_STATUS_UNINIT(Fls_Global.status, FLS_ERASE_ID);

  if( Fls_Global.jobResultType == MEMIF_JOB_PENDING ) {
    switch(Fls_Global.jobType) {
    case FLS_JOB_COMPARE:
      // NOT implemented. Hardware error = FLS_E_COMPARE_FAILED
      // ( we are reading directly from flash so it makes no sense )

      result = memcmp(Fls_Global.targetAddr,(void *)Fls_Global.sourceAddr,Fls_Global.length);
      if( result == 0 ) {
        Fls_Global.jobResultType = MEMIF_JOB_OK;
      } else {
    	Fls_Global.jobResultType = MEMIF_BLOCK_INCONSISTENT;
      }
      Fls_Global.status = MEMIF_IDLE;
      Fls_Global.jobType = FLS_JOB_NONE;

      break;
    case FLS_JOB_ERASE:
    {
//      uint32 failAddress;
//      uint32 failData;
#if defined(CFG_MPC5606S)
      if ( Fls_Global.sourceAddr < 0x80000 ) {
    	  flashStatus = Fls_C90FL_EraseStatus(&ssdConfig);
      }
      else if ( Fls_Global.sourceAddr < 0x100000 ){
    	  flashStatus = Fls_C90FL_EraseStatus(&ssdCode1Config);
      }
      else {
    	  flashStatus = Fls_C90FL_EraseStatus(&ssdDataConfig);
      }
      if( flashStatus == C90FL_OK ) {
              Fls_EraseBlockType blocks;
              // Lock all.
              blocks.highEnabledBlocks = (-1UL);
              blocks.midEnabledBlocks = (-1UL);
              blocks.highEnabledBlocks = (-1UL);
              blocks.shadowBlocks = (-1UL);

              if ( Fls_Global.sourceAddr < 0x80000 ) {
              	  Fls_C90FL_SetLock(&ssdConfig, &blocks,1);
                }
                else if ( Fls_Global.sourceAddr < 0x100000 ){
              	  Fls_C90FL_SetLock(&ssdCode1Config, &blocks,1);
                }
                else {
              	  Fls_C90FL_SetLock(&ssdDataConfig, &blocks,1);
                }
              Fls_Global.jobResultType = MEMIF_JOB_OK;
              Fls_Global.jobType = FLS_JOB_NONE;
              Fls_Global.status = MEMIF_IDLE;
              FEE_JOB_END_NOTIFICATION();
            } else if( flashStatus == C90FL_BUSY )  {
              /* Busy, Do nothing */
            } else {
              // Error
              Fls_Global.jobResultType = MEMIF_JOB_FAILED;
              Fls_Global.jobType = FLS_JOB_NONE;
              Fls_Global.status = MEMIF_IDLE;
      #if defined(USE_DEM)
      		Dem_ReportErrorStatus(FLS_E_WRITE_FAILED, DEM_EVENT_STATUS_FAILED);
      #endif
              FEE_JOB_ERROR_NOTIFICATION();
            }
#else
      flashStatus = Fls_H7F_EraseStatus(&ssdConfig);
      if( flashStatus == H7F_OK ) {
        Fls_EraseBlockType blocks;
        // Lock all.
        blocks.highEnabledBlocks = (-1UL);
        blocks.midEnabledBlocks = (-1UL);
        blocks.highEnabledBlocks = (-1UL);
        blocks.shadowBlocks = (-1UL);

        Fls_H7F_SetLock(&blocks,1);

        Fls_Global.jobResultType = MEMIF_JOB_OK;
        Fls_Global.jobType = FLS_JOB_NONE;
        Fls_Global.status = MEMIF_IDLE;
        FEE_JOB_END_NOTIFICATION();
      } else if( flashStatus == H7F_BUSY )  {
        /* Busy, Do nothing */
      } else {
        // Error
        Fls_Global.jobResultType = MEMIF_JOB_FAILED;
        Fls_Global.jobType = FLS_JOB_NONE;
        Fls_Global.status = MEMIF_IDLE;
#if defined(USE_DEM)
		Dem_ReportErrorStatus(FLS_E_WRITE_FAILED, DEM_EVENT_STATUS_FAILED);
#endif
        FEE_JOB_ERROR_NOTIFICATION();
      }
#endif
      break;
    }
    case FLS_JOB_READ:

      // NOT implemented. Hardware error = FLS_E_READ_FAILED
      // ( we are reading directly from flash so it makes no sense )
      memcpy(Fls_Global.targetAddr,(void *)Fls_Global.sourceAddr,Fls_Global.length);
      Fls_Global.jobResultType = MEMIF_JOB_OK;
      Fls_Global.status = MEMIF_IDLE;
      Fls_Global.jobType = FLS_JOB_NONE;
      FEE_JOB_END_NOTIFICATION();
      break;
    case FLS_JOB_WRITE:
    {
      // NOT implemented. Hardware error = FLS_E_READ_FAILED
#if defined(CFG_MPC5606S)
      if ( Fls_Global.flashWriteInfo.dest < 0x80000) {
    	  flashStatus = Fls_C90FL_Program( &ssdConfig,&Fls_Global.flashWriteInfo);
      }
      else if ( Fls_Global.flashWriteInfo.dest < 0x100000) {
    	  flashStatus = Fls_C90FL_Program( &ssdCode1Config,&Fls_Global.flashWriteInfo);
      }
      else {
    	  flashStatus = Fls_C90FL_Program( &ssdDataConfig,&Fls_Global.flashWriteInfo);
      }
      if( flashStatus == C90FL_OK ) {
              Fls_EraseBlockType blocks;
              blocks.highEnabledBlocks = (-1UL);
              blocks.midEnabledBlocks = (-1UL);
              blocks.highEnabledBlocks = (-1UL);
              blocks.shadowBlocks = (-1UL);

              // Lock all
              if ( Fls_Global.flashWriteInfo.dest < 0x80000 ) {
				  Fls_C90FL_SetLock(&ssdConfig, &blocks,1);
			  }
			  else if ( Fls_Global.flashWriteInfo.dest < 0x100000 ){
				  Fls_C90FL_SetLock(&ssdCode1Config, &blocks,1);
			  }
			  else {
				  Fls_C90FL_SetLock(&ssdDataConfig, &blocks,1);
			  }

              Fls_Global.jobResultType = MEMIF_JOB_OK;
              Fls_Global.jobType = FLS_JOB_NONE;
              Fls_Global.status = MEMIF_IDLE;
              FEE_JOB_END_NOTIFICATION();
            } else if( flashStatus == C90FL_BUSY )  {
              /* Busy, Do nothing */
            } else {
              // Error
              Fls_Global.jobResultType = MEMIF_JOB_FAILED;
              Fls_Global.jobType = FLS_JOB_NONE;
              Fls_Global.status = MEMIF_IDLE;
      #if defined(USE_DEM)
      		Dem_ReportErrorStatus(FLS_E_WRITE_FAILED, DEM_EVENT_STATUS_FAILED);
      #endif
      		FEE_JOB_ERROR_NOTIFICATION();
            }
#else
      flashStatus = Fls_H7F_Program( &ssdConfig,&Fls_Global.flashWriteInfo);

      if( flashStatus == H7F_OK ) {
        Fls_EraseBlockType blocks;
        blocks.highEnabledBlocks = (-1UL);
        blocks.midEnabledBlocks = (-1UL);
        blocks.highEnabledBlocks = (-1UL);
        blocks.shadowBlocks = (-1UL);

