openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Fls.c
        // Lock all
        Fls_H7F_SetLock(&blocks,1);

        Fls_Global.jobResultType = MEMIF_JOB_OK;
        Fls_Global.jobType = FLS_JOB_NONE;
        Fls_Global.status = MEMIF_IDLE;
        FEE_JOB_END_NOTIFICATION();
      } else if( flashStatus == H7F_BUSY )  {
        /* Busy, Do nothing */
      } else {
        // Error
        Fls_Global.jobResultType = MEMIF_JOB_FAILED;
        Fls_Global.jobType = FLS_JOB_NONE;
        Fls_Global.status = MEMIF_IDLE;
#if defined(USE_DEM)
		Dem_ReportErrorStatus(FLS_E_WRITE_FAILED, DEM_EVENT_STATUS_FAILED);
#endif
		FEE_JOB_ERROR_NOTIFICATION();
      }
#endif
      break;
    }
    case FLS_JOB_NONE:
      assert(0);
      break;
    }
  }
}


Std_ReturnType Fls_Read (	Fls_AddressType SourceAddress,
              uint8 *TargetAddressPtr,
              Fls_LengthType Length )
{
  FLS_VALIDATE_STATUS_UNINIT_W_RV(Fls_Global.status, FLS_READ_ID, E_NOT_OK);
  FLS_VALIDATE_STATUS_BUSY_W_RV(Fls_Global.status, FLS_READ_ID, E_NOT_OK);
  FLS_VALIDATE_READ_PARAM_ADDRESS_PAGE_W_RV(SourceAddress, FLS_READ_ID, E_NOT_OK);
  FLS_VALIDATE_READ_PARAM_LENGTH_PAGE_W_RV(SourceAddress, Length, FLS_READ_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_DATA_W_RV((void*)TargetAddressPtr, FLS_READ_ID, E_NOT_OK)

  // Always check if status is not busy
  if (Fls_Global.status == MEMIF_BUSY )
     return E_NOT_OK;

  Fls_Global.status = MEMIF_BUSY;
  Fls_Global.jobResultType = MEMIF_JOB_PENDING;
  Fls_Global.jobType = FLS_JOB_READ;

  Fls_Global.sourceAddr = SourceAddress;
  Fls_Global.targetAddr = TargetAddressPtr;
  Fls_Global.length = Length;

  return E_OK;
}

#if ( FLS_COMPARE_API == STD_ON )
Std_ReturnType Fls_Compare( Fls_AddressType SourceAddress,
              uint8 *TargetAddressPtr,
              Fls_LengthType Length )
{
  FLS_VALIDATE_STATUS_UNINIT_W_RV(Fls_Global.status, FLS_COMPARE_ID, E_NOT_OK);
  FLS_VALIDATE_STATUS_BUSY_W_RV(Fls_Global.status, FLS_COMPARE_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_ADDRESS_PAGE_W_RV(SourceAddress, FLS_COMPARE_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_LENGTH_PAGE_W_RV(SourceAddress, Length, FLS_COMPARE_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_DATA_W_RV((void*)TargetAddressPtr,FLS_COMPARE_ID, E_NOT_OK)

  // Always check if status is not busy
  if (Fls_Global.status == MEMIF_BUSY )
     return E_NOT_OK;

  Fls_Global.status = MEMIF_BUSY;
  Fls_Global.jobResultType = MEMIF_JOB_PENDING;
  Fls_Global.jobType = FLS_JOB_COMPARE;

  Fls_Global.sourceAddr = SourceAddress;
  Fls_Global.targetAddr = TargetAddressPtr;
  Fls_Global.length = Length;

  return E_OK;
}
#endif

#if ( FLS_SET_MODE_API == STD_ON )
void Fls_SetMode(		MemIf_ModeType Mode )
{
	/* API NOT SUPPORTED */
}
#endif

#if ( FLS_VERSION_INFO_API == STD_ON )
void Fls_GetVersionInfo( Std_VersionInfoType *VersioninfoPtr )
{
  memcpy(VersioninfoPtr, &_Fls_VersionInfo, sizeof(Std_VersionInfoType));
}
#endif

void Fls_Check( uint32 flsBaseAddress, uint32 flsTotalSize )
{
  // ECC checking is always on by default.
  // If a non correctable error is discovered
  // we will get an IVOR2 exception.

  // Enable Flash Non_Correctible Reporting,
  // Not really necessary but makes more information
  // available in the MCM registers if an error occurs.
#if defined(CFG_MPC5606S) || defined(CFG_MPC5567)
  ECSM.ECR.B.EFNCR = 1;
#elif defined (CFG_MPC5516)
  MCM.ECR.B.EFNCR = 1;
#else
#error "Non supported processor"
#endif

  // Read flash in 32bit chunks, it's most efficient.
  uint32* memoryChunkPtr = (uint32*)flsBaseAddress;
  uint32* flsTotalSizePtr = (uint32*)flsTotalSize;
  uint32  memoryChunk = *memoryChunkPtr; // The first read

  // Read the rest of the flash, chunk by chunk
  while(memoryChunkPtr < flsTotalSizePtr)
  {
    memoryChunk=*(memoryChunkPtr++);
  }
}


